Repository: xcv58/MacTools
Catalog: Plugins/DockLock/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# metadata.title
source: 锁定程序坞
ar: قفل Dock
de: Dock-Sperre
en: Dock Lock
es: Bloqueo del Dock
fr: Verrouillage du Dock
ja: Dockの固定
ko: Dock 잠금
pt: Bloqueio do Dock
ru: Блокировка Dock
tr: Dock Kilidi
zh_hant: 鎖定 Dock

# metadata.description
source: 防止程序坞在多显示器之间意外移动
ar: امنع انتقال Dock بين الشاشات عن طريق الخطأ.
de: Verhindert, dass das Dock versehentlich zwischen Displays verschoben wird.
en: Prevent the Dock from moving between displays accidentally.
es: Evita que el Dock se mueva accidentalmente entre pantallas.
fr: Empêche le Dock de passer accidentellement d’un écran à l’autre.
ja: Dockが誤ってディスプレイ間を移動しないようにします。
ko: Dock이 실수로 디스플레이 사이를 이동하지 않도록 합니다.
pt: Impeça que o Dock se mova acidentalmente entre monitores.
ru: Не позволяет Dock случайно перемещаться между дисплеями.
tr: Dock'un ekranlar arasında yanlışlıkla taşınmasını önleyin.
zh_hant: 防止 Dock 意外移動到其他顯示器。

# panel.subtitle.enabled
source: 已开启
ar: تشغيل
de: Ein
en: On
es: Activado
fr: Activé
ja: オン
ko: 켜짐
pt: Ligado
ru: Вкл.
tr: Açık
zh_hant: 已開啟

# panel.subtitle.disabled
source: 已关闭
ar: معطل
de: Aus
en: Off
es: Desactivado
fr: Désactivé
ja: オフ
ko: 꺼짐
pt: Desligado
ru: Выкл.
tr: Kapalı
zh_hant: 已關閉

# panel.subtitle.needsPermission
source: 需要辅助功能授权
ar: يلزم منح إذن تسهيلات الاستخدام
de: Berechtigung für Bedienungshilfen erforderlich
en: Accessibility permission required
es: Se requiere permiso de accesibilidad
fr: Autorisation Accessibilité requise
ja: アクセシビリティ権限が必要です
ko: 손쉬운 사용 권한이 필요합니다.
pt: É necessária permissão de acessibilidade
ru: Требуется разрешение на универсальный доступ
tr: Erişilebilirlik izni gerekiyor
zh_hant: 需要輔助使用授權

# permission.accessibility.title
source: 辅助功能
ar: تسهيلات الاستخدام
de: Bedienungshilfen
en: Accessibility
es: Accesibilidad
fr: Accessibilité
ja: アクセシビリティ
ko: 손쉬운 사용
pt: Acessibilidade
ru: Универсальный доступ
tr: Erişilebilirlik
zh_hant: 輔助使用

# permission.accessibility.description
source: 用于拦截其他显示器的外露底边，防止程序坞跳到其他显示器。
ar: يُبقي المؤشر بعيدًا عن الحواف السفلية المكشوفة للشاشات الأخرى لمنع انتقال Dock بين الشاشات.
de: Fängt Bewegungen an den unteren Bildschirmrändern anderer Bildschirme ab, um zu verhindern, dass das Dock zwischen Bildschirmen springt.
en: Keeps the pointer away from exposed bottom edges on other displays to prevent the Dock from moving between displays.
es: Intercepta los bordes inferiores expuestos en otras pantallas para evitar que el Dock salte entre pantallas.
fr: Intercepte les bords inférieurs exposés des autres écrans afin d’empêcher le Dock de changer d’écran.
ja: 他のディスプレイの露出した下端を遮断し、Dock がディスプレイ間でジャンプするのを防ぎます。
ko: 다른 디스플레이의 노출된 하단 가장자리에서 포인터 이동을 막아 Dock이 디스플레이 사이를 이동하지 않도록 합니다.
pt: Mantém o ponteiro afastado das bordas inferiores expostas de outros monitores para impedir que o Dock mude de monitor.
ru: Перехватывает наведение указателя на открытые нижние края других дисплеев, чтобы Dock не перемещался между дисплеями.
tr: Dock'un ekranlar arasında atlamasını önlemek için diğer ekranlardaki açıkta kalan alt kenarları yakalar.
zh_hant: 用於攔截其他顯示器的外露底邊，防止 Dock 跳到其他顯示器。

# permission.accessibility.footnote
source: 在系统设置的“隐私与安全性 > 辅助功能”中允许 MacTools。
ar: اسمح لـ MacTools في إعدادات النظام > الخصوصية والأمن > تسهيلات الاستخدام.
de: Erlaube MacTools den Zugriff unter Systemeinstellungen > Datenschutz & Sicherheit > Bedienungshilfen.
en: Allow MacTools in System Settings > Privacy & Security > Accessibility.
es: Permite MacTools en Ajustes del Sistema > Privacidad y seguridad > Accesibilidad.
fr: Autorisez MacTools dans Réglages Système > Confidentialité et sécurité > Accessibilité.
ja: システム設定 > プライバシーとセキュリティ > アクセシビリティでMacToolsを許可してください。
ko: 시스템 설정 > 개인정보 보호 및 보안 > 손쉬운 사용에서 MacTools를 허용하세요.
pt: Permita o MacTools em Ajustes do Sistema > Privacidade e Segurança > Acessibilidade.
ru: Разрешите MacTools в Системных настройках > Конфиденциальность и безопасность > Универсальный доступ.
tr: Sistem Ayarları > Gizlilik ve Güvenlik > Erişilebilirlik bölümünde MacTools'a izin verin.
zh_hant: 在「系統設定」>「隱私權與安全性」>「輔助使用」中允許 MacTools。

# settings.section.title
source: 设置
ar: الإعدادات
de: Einstellungen
en: Settings
es: Configuración
fr: Réglages
ja: 設定
ko: 설정
pt: Configurações
ru: Настройки
tr: Ayarlar
zh_hant: 設定

# settings.enable.title
source: 启用
ar: تمكين
de: Aktivieren
en: Enable
es: Habilitar
fr: Activer
ja: 有効にする
ko: 활성화
pt: Habilitar
ru: Включить
tr: Etkinleştir
zh_hant: 啟用

# settings.enable.description
source: 开启后防止程序坞在多显示器之间意外移动。
ar: عند التمكين، يُمنع انتقال Dock بين الشاشات عن طريق الخطأ.
de: Bei Aktivierung wird verhindert, dass das Dock versehentlich zwischen Bildschirmen verschoben wird.
en: When enabled, prevent the Dock from moving between displays accidentally.
es: Cuando está habilitado, evita que el Dock se mueva entre pantallas accidentalmente.
fr: Une fois activé, empêche le Dock de passer accidentellement d’un écran à l’autre.
ja: 有効にすると、Dock がディスプレイ間を誤って移動するのを防ぎます。
ko: 활성화되면 Dock이 실수로 디스플레이 사이를 이동하는 것을 방지합니다.
pt: Quando ativado, evita que o Dock se mova acidentalmente entre monitores.
ru: Если этот параметр включен, предотвращает случайное перемещение Dock между дисплеями.
tr: Etkinleştirildiğinde Dock'un ekranlar arasında yanlışlıkla taşınması önlenir.
zh_hant: 開啟後防止 Dock 在多顯示器之間意外移動。

# error.accessibilityRequired
source: Dock 锁定需要辅助功能权限。
ar: يحتاج قفل Dock إلى إذن تسهيلات الاستخدام.
de: Die Dock-Sperre benötigt die Berechtigung für Bedienungshilfen.
en: Dock Lock needs Accessibility permission.
es: Bloqueo del Dock necesita permiso de Accesibilidad.
fr: Le verrouillage du Dock nécessite l’autorisation Accessibilité.
ja: Dock ロックにはアクセシビリティ権限が必要です。
ko: Dock 잠금에는 손쉬운 사용 권한이 필요합니다.
pt: O Bloqueio do Dock precisa de permissão de Acessibilidade.
ru: Для блокировки Dock требуется разрешение на универсальный доступ.
tr: Dock Kilidi, Erişilebilirlik izni gerektiriyor.
zh_hant: 「鎖定 Dock」需要輔助使用權限。

# error.accessibilityRevoked
source: 辅助功能权限已关闭，Dock 锁定已暂停。
ar: تم إلغاء إذن تسهيلات الاستخدام؛ تم إيقاف قفل Dock مؤقتًا.
de: Die Berechtigung für Bedienungshilfen wurde widerrufen; die Dock-Sperre ist pausiert.
en: Accessibility permission was revoked; Dock Lock is paused.
es: Se revocó el permiso de Accesibilidad; Bloqueo del Dock está en pausa.
fr: L’autorisation Accessibilité a été révoquée ; le verrouillage du Dock est en pause.
ja: アクセシビリティ権限が取り消されました。 Dock ロックが一時停止されています。
ko: 손쉬운 사용 권한이 해제되어 Dock 잠금이 일시 중지되었습니다.
pt: A permissão de Acessibilidade foi revogada; o Bloqueio do Dock está pausado.
ru: Разрешение на универсальный доступ отозвано; блокировка Dock приостановлена.
tr: Erişilebilirlik izni kaldırıldı; Dock Kilidi duraklatıldı.
zh_hant: 輔助使用權限已撤銷；「鎖定 Dock」已暫停。

# error.startFailed
source: 无法启动 Dock 锁定，请检查辅助功能权限。
ar: تعذر بدء تشغيل قفل Dock. تحقق من إذن تسهيلات الاستخدام.
de: Die Dock-Sperre konnte nicht gestartet werden. Überprüfen Sie die Berechtigung für Bedienungshilfen.
en: Dock Lock could not start. Check Accessibility permission.
es: No se pudo iniciar Bloqueo del Dock. Comprueba el permiso de Accesibilidad.
fr: Impossible de démarrer le verrouillage du Dock. Vérifiez l’autorisation Accessibilité.
ja: Dock ロックを開始できませんでした。アクセシビリティ権限を確認してください。
ko: Dock 잠금을 시작할 수 없습니다. 손쉬운 사용 권한을 확인하세요.
pt: O Bloqueio do Dock não pôde ser iniciado. Verifique a permissão de Acessibilidade.
ru: Не удалось включить блокировку Dock. Проверьте разрешение на универсальный доступ.
tr: Dock Kilidi başlatılamadı. Erişilebilirlik iznini denetleyin.
zh_hant: 無法啟動「鎖定 Dock」，請檢查輔助使用權限。

# action.toggle.title
source: 切换程序坞锁定
ar: تبديل قفل Dock
de: Dock-Sperre umschalten
en: Toggle Dock Lock
es: Alternar bloqueo del Dock
fr: Activer ou désactiver le verrouillage du Dock
ja: Dockロックを切り替える
ko: Dock 잠금 전환
pt: Alternar Bloqueio do Dock
ru: Переключить блокировку Dock
tr: Dock Kilidini Aç/Kapat
zh_hant: 切換程式塢鎖定

# action.enable.title
source: 开启程序坞锁定
ar: تشغيل قفل Dock
de: Dock-Sperre einschalten
en: Turn On Dock Lock
es: Activar bloqueo del Dock
fr: Activer le verrouillage du Dock
ja: Dockロックをオンにする
ko: Dock 잠금 켜기
pt: Ativar Bloqueio do Dock
ru: Включить блокировку Dock
tr: Dock Kilidini Aç
zh_hant: 開啟程式塢鎖定

# action.disable.title
source: 关闭程序坞锁定
ar: إيقاف قفل Dock
de: Dock-Sperre ausschalten
en: Turn Off Dock Lock
es: Desactivar bloqueo del Dock
fr: Désactiver le verrouillage du Dock
ja: Dockロックをオフにする
ko: Dock 잠금 끄기
pt: Desativar Bloqueio do Dock
ru: Выключить блокировку Dock
tr: Dock Kilidini Kapat
zh_hant: 關閉程式塢鎖定
